app/controllers/books_controller.rb

SELECT "books".* FROM "books"
INSERT INTO "books" ("title", "body", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "MMMMMMMMMMMMMMMMMMM"], ["body", "hhhhhh"], ["created_at", "2019-11-12 05:44:36.155598"], ["updated_at", "2019-11-12 05:44:36.155598"]]
---
  def create
    @books = Book.all
    @book = Book.new(book_params)
    if @book.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 3]]
---
  def destroy
    book = Book.find(params[:id])
    if book.destroy